# DataFrame

In [1]:
import pandas as pd
import numpy  as np

In [3]:
data = {"name":["Bill","Tom","Tim","John","Alex","Vanessa","Kate"],      
       "score":[90,80,85,75,95,60,65],      
       "sport":["Wrestling","Football","Skiing","Swimming","Tennis",
               "Karete","Surfing"],      
       "sex":["M","M","M","M","F","F","F"]}

In [ ]:
type(data)

In [ ]:
df=pd.DataFrame(data)
type(df)

In [ ]:
df.head()

In [ ]:
df=pd.DataFrame(data,columns=["name","sport","sex","score"])
df

In [ ]:
df["sport"]

In [ ]:
df[["name","sport"]]

# select name, sport from table;

In [ ]:
df["age"]=18
df.head()

In [ ]:
df=pd.DataFrame(data,columns=["name", "sport", "gender", "score", "age"], 
                index=["one","two","three","four","five","six","seven"])


values=[18,19,20,18,17,17,18]
df["age"]=values
df

In [ ]:
df[df.score>=70]

In [ ]:
df.score>=70

In [ ]:
df["pass"] = df.score>=70
df

In [ ]:
np.where(df["pass"]==True, "YES", "NO")

In [ ]:
df.head()

In [ ]:
del df["pass"]
df.head()

In [ ]:
# -----TILL this -- 5th July
# Will continue from 6th

In [19]:
df=pd.DataFrame(data,columns=["name", "sport", "gender", "score", "age"], 
                index=["one","two","three","four","five","six","seven"])


values=[18,19,20,18,17,17,18]
df["age"]=values
df

df.head()

       name      sport gender  score  age
one    Bill  Wrestling    NaN     90   18
two     Tom   Football    NaN     80   19
three   Tim     Skiing    NaN     85   20
four   John   Swimming    NaN     75   18
five   Alex     Tennis    NaN     95   17

In [20]:
df.reset_index(drop = True, inplace = True)

In [21]:
df.head(2)

   name      sport gender  score  age
0  Bill  Wrestling    NaN     90   18
1   Tom   Football    NaN     80   19

In [22]:
df.set_index("name")

             sport gender  score  age
name
Bill     Wrestling    NaN     90   18
Tom       Football    NaN     80   19
Tim         Skiing    NaN     85   20
John      Swimming    NaN     75   18
Alex        Tennis    NaN     95   17
Vanessa     Karete    NaN     60   17
Kate       Surfing    NaN     65   18

In [23]:
df.reset_index(inplace = True)

In [24]:
df.head()

   index  name      sport gender  score  age
0      0  Bill  Wrestling    NaN     90   18
1      1   Tom   Football    NaN     80   19
2      2   Tim     Skiing    NaN     85   20
3      3  John   Swimming    NaN     75   18
4      4  Alex     Tennis    NaN     95   17